app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars"
---
    def index
        cars = Car.all

SELECT "cars".* FROM "cars" WHERE "cars"."id" = 2 LIMIT 1
---
    def show
        car = Car.find(params[:id])